#include <reg52.h>
#include <intrins.h>
#include "IIC.h"
#include "DELAY.h"

/**************************************
开始信号
**************************************/
void Start()
{
    SDA = 1;                    //拉高数据线
    SCL = 1;                    //拉高时钟线
    Delay5us();                 //延时
    SDA = 0;                    //拉低数据线
    Delay5us();                 //延时
    SCL = 0;                    //拉低时钟线
}
/**************************************
结束信号
**************************************/
void Stop()
{
    SDA = 0;                    //拉低数据线
    SCL = 1;                    //拉高时钟线
    Delay5us();                 //延时
    SDA = 1;                    //产生上升沿
    Delay5us();                 //延时
}
/**************************************
发送应答信号
**************************************/
void SendACK(bit ack)
{
    SDA = ack;                  //写应答信号
    SCL = 1;                    //拉高时钟线
    Delay5us();                 //延时
    SCL = 0;                    //拉低时钟线
    Delay5us();                 //延时
}
/**************************************
接收应答信号
**************************************/
bit RecvACK()
{
    SCL = 1;                    //拉高时钟线
    Delay5us();                 //延时
    CY = SDA;                   //读取应答信号
    SCL = 0;                    //拉低时钟线
    Delay5us();                 //延时
    return CY;  //返回应答数据
}


/**************************************
向IIC总线发送一字节数据
**************************************/
void SendByte(uchar dat)
{
    uchar i;
    for (i=0; i<8; i++)         //8位计数器
    {
        dat <<= 1;              //移除数据最高位
        SDA = CY;               //送数据口
        SCL = 1;                //拉高时钟线
        Delay5us();             //延时
        SCL = 0;                //拉低时钟线
        Delay5us();             //延时
    }
    RecvACK();
}
/**************************************
向IIC总线取一字节数据
**************************************/
uchar RecvByte()
{
    uchar i;
    uchar dat = 0;
    SDA = 1;                    //拉高数据线
    for (i=0; i<8; i++)         //8为计数器
    {
        dat <<= 1;				//左移一位
        SCL = 1;                
        Delay5us();             //延时
        dat |= SDA;             //读数据              
        SCL = 0;                //拉低时钟线
        Delay5us();             //延时
    }
    return dat;   //返回一字节数据
}





